[
  {
    "id": "reddit-1",
    "text": "Our friends at The Meaning Movement created this great cheatsheet for improving your LinkedIn profile. It's free and a great resource for your career. Enjoy!"
  },
  {
    "id": "reddit-2",
    "text": "Hi everyone! Welcome to r/work! Here are a couple things to keep in mind when posting:  \n**1) Karma -** There is a minimum karma requirement for posting in order to prevent spam. If you've never posted to Reddit before, you're going to need to interact and gain some karma before posting here.  \n**2) Content and engagement** - This community prefers dialogue, questions, and engagement. Don't post here just to get clicks on your YouTube channel or whatever. If you're looking for work memes, check out /r/workmemes/."
  },
  {
    "id": "reddit-3",
    "text": "So I started working this part-time job almost two months ago and I've noticed that people get a little offended/annoyed when you don't share details about your personal life. \n\nPersonally, I've always tried separating my personal life with work. I don't want my coworkers knowing anything about me personally, except if I develop an affinity for someone. \n\nIn this job specifically, I've noticed that a portion of the other coworkers share EVERYTHING with each other (marital problems, kid issues, etc). Personally, I haven't shared anything personal about me except for very standard things (such as what I study, etc.), but I feel the rest don't really like that. \n\nIs this something that's commonly experienced in workplaces?"
  },
  {
    "id": "reddit-4",
    "text": "I started a new job recently. I asked for $55K starting salary as the minimum. They only offered me $50K and said that was the max they could do (I took it because I had no other offers, but was not happy with that salary).\n\n2 weeks later and I get another job offer. This one is 100% remote (the other position I accepted was in person and a 40 minute commute each way). And this one offered me $70K to start. Of course I took it!\n\nWhen I let my boss know I was leaving for the other job, after only two weeks working there, she starts saying \"Well I would like to retain you, I can see if I can get approval for a $55K salary for you. I laughed and explained what I was offered ($20K more & remote) and that I know it would be impossible for them to offer me that. She said, you're right, we can't match that. Then she gets all upset and starts lecturing me about how they invested so much time and training into me and now I'm leaving them in a bind.\n\nA month later I see her stalking my LinkedIn profile (because I didn't mention the new company name when I quit).\n\nLol can you believe the nerve of these people? Absolutely clueless!"
  },
  {
    "id": "reddit-5",
    "text": "I have my annual review tomorrow. This is my first job after graduating college and I have had a rough start, which I believe is just due to a learning curve and it being my first job. I tend to get anxious sometimes, and then it results in my crying even if I don’t want to cry. I’m wondering if anyone else experiences this and maybe has any advice to prevent this from happening tomorrow. This isn’t my first review with them as I started around the time of annual review time last year but have recently become more anxious at work."
  },
  {
    "id": "reddit-6",
    "text": "I’m 21F and I work at my school's cafeteria as a cashier. My coworker has some personal issues that affect their work attendance, and I often have to cover for them when they leave early or don't show up. I find myself constantly adjusting my tasks to accommodate their needs, which can be challenging. While I understand and sympathize with their situation, I sometimes feel overwhelmed by the extra workload. Despite this, we have a good relationship, and I appreciate the help they have given me outside of work. I can't help but feel conflicted about my feelings of frustration in this situation."
  },
  {
    "id": "reddit-7",
    "text": "Curious to hear how people in advertising or media are actually using AI tools to their advantage. Not the generic \"it'll replace creatives\" conversation, but the real, practical stuff. And not using it to help draft emails or LinkedIn posts.\n\nI've been experimenting with a few things myself (mostly for help concepting and story-boarding) but I'm still trying to figure out what's genuinely useful long-term vs. just quick hit, on-the-spot help.\n\nIf you work in creative, strategy, or media, I'd love to hear what parts of your workflow AI has improved? And when is it really not worth spending the extra time creating a prompt to train AI for?"
  },
  {
    "id": "reddit-8",
    "text": "I’m the only person at my job that has a good attitude, that does every task without being asked, and if you do ask i almost always already did it. i know every station, i know how to train new people, i know how to help. everyone else just sits on their behind and makes the same dollar i do. and i know “why bust your behind if you don’t have to”. but not only does my shift goes by faster when i work my hardest,  im not gonna stoop lower just because everyone around me does. but it’s definitely taken a mental toll on me always being the one to cover shifts and being asked to do hardest tasks that everyone’s too lazy to help with. i just struggle because this job makes me enough money (emphasis on the enough) and it’s the only place i can work at this wage to keep myself afloat in my area. has anyone gone through similar feelings or experiences?"
  },
  {
    "id": "reddit-9",
    "text": "I really dislike this time of year when we're asked to make goals for the next year. I just want to keep doing what I'm doing. I'm not looking to move up...I just want to do my job. After a while, there is only so much a person can list as a goal...or 3 to 5 goals. And I work remote so I can't have any goals that require in-person activities.\n\nEvery year, I have no idea what to even put, and it doesn't help that I wait until the last possible moment to get this done! 😭"
  },
  {
    "id": "reddit-10",
    "text": "Okay, long story short, I was working Wednesdays through Sundays every week for over a year. I got tired of never having a single day of the weekend to myself. I tried to request Sundays off, but my manager refused. I went above her head and spoke to the GM, who approved my request. In retaliation, my manager cut my Fridays in addition to Sundays, leaving me with only 2-3 days a week. She also gossiped about everyone behind their backs. I contacted HR, who advised me to talk to the GM. The GM promised to try to get me hours at another store, but nothing came of it. Eventually, my manager had to give me my Fridays back because she couldn't find anyone else to work. \n\nRecently, she told me I had to work either Christmas or Thanksgiving. We had the same argument last year, and I refused to miss time with my family for minimum wage. In response, she cut my hours again to 2-3 days a week. My friends and coworkers believe this is clear retaliation and suggest suing the company. I'm unsure about the payout for a retaliation lawsuit or if it's worth pursuing. Should I contact HR again for guidance? Any help in navigating this situation would be appreciated."
  },
  {
    "id": "reddit-11",
    "text": "I'm a VP of a small software company, and we have a new CEO. He's very focused on connecting with C-level executives at our clients, and insists that my team should mainly interact with C-level members. He mentioned that \"Anything less than Director is not valuable.\"\n\nGiven that we work with global companies, meeting with these executives is extremely challenging.\n\nHowever, I also interact with our vendors, and I've been providing the CEO's contact information, suggesting that he enjoys direct connections with our vendor partners.\n\nThis approach has resulted in three calls this week, and he is becoming frustrated."
  },
  {
    "id": "reddit-12",
    "text": "This keeps happening to me at work and I honestly don’t know the right way to handle it.\n\nI’ll start sharing an idea in a meeting, and before I can finish, someone jumps in — sometimes to “add” to what I’m saying, sometimes to change the topic entirely.  \nIt happens so fast that I just… stop talking.\n\nThen I sit there feeling invisible while the conversation moves on, and all I can think is how small I must have looked.\n\nAfterward, I get frustrated with myself for not speaking up — I imagine myself saying something confident like,\n\nBut in real life, I just freeze and smile politely.\n\nI know they’re probably not doing it maliciously, but it still hurts.\n\nHow do you handle it in the moment without sounding defensive or awkward?  \nAnd how do you rebuild confidence when it starts to feel like your voice doesn’t matter in the room?"
  },
  {
    "id": "reddit-13",
    "text": "So, apparently people at my job have been gossiping recently. My boss sent out an email saying that if anyone gossips they get written up. However, my boss also said that even if the gossiping occurs outside of work you could get written up. That doesn’t seem right to me. Can she really write someone up if they met up with a coworker outside of work and gossiped?"
  },
  {
    "id": "reddit-14",
    "text": "Hey all,\n\nThis is my first post in this sub, I’m looking for some validation and advice on how to handle my current situation at work.\n\nBasically, I have a difficult coworker at my job, a woman in her mid 40s who I will be referring to as Shannon. At first, we got along well, she came off as very bubbly and charismatic, and we were able to have good conversations. Then, not long after she must’ve decided that she didn’t like the way things were run around here. She took particular issue with the way in which the other campus aides and I bring the trash barrels around to each table near the end of each lunch period. We ask students to pass down trash so that the tables are clear for the custodians to clean afterwards. Shannon decided that this was “spoiling” the kids, and multiple times I’ve gotten snide comments. She doesn’t push barrels herself but even will confront students who have trash and make them get up in an aggressive manner.\n\nOverall, it’s become increasingly challenging to coexist with her, as she is clearly not my boss and has no authority to boss me around, but for some reason feels like she has the right to give me directions and has been difficult across the board. I’m not a very confrontational—or even assertive—person, but it’s gotten to the point where I can no longer brush off her constant pokes. So I’m looking for professional ways to say “that’s not my job”, “you’re not in charge”, or anything along those lines that doesn’t seem unnecessarily incendiary but still sends the clear message to stay in her lane and stop expecting things to change because she wants them to.\n\nAny advice?"
  },
  {
    "id": "reddit-15",
    "text": "Little backstory: I work at my college's on-campus coffee shop. I have been here for a year and a half and I enjoy working with my coworkers. However, my boss has been a problem. I had to take a break during the summer due to personal reasons, and when I returned, my boss started making inappropriate jokes about my situation. Today, it crossed a line when he called me a brat in front of my coworkers, referring to what happened over the summer. He shared personal details about my situation without my consent.\n\nI am unsure about how to handle this situation. I value my job but I also don't want to tolerate this behavior. Should I consider reporting my boss? I am concerned about potential repercussions. Am I overreacting?"
  },
  {
    "id": "reddit-16",
    "text": "My company was recently acquired, leading to changes in travel booking procedures. Previously, I was issued a business credit card to cover expenses. Now, the new company is transitioning to Concur for travel booking and expects us to pay for meals, transportation, gas, parking, etc., and will reimburse us biweekly. Given my frequent travel to multiple cities each week, expenses can quickly add up to $200-300 due to airport parking, gas, and meals. Do you think my concerns are valid or am I overreacting?"
  },
  {
    "id": "reddit-17",
    "text": "The person who contacted me (recruiter) isn't the person who interviewed me, the team manager did. I don't have the manager's name, I only have the recruiter's email. How can I send a thank you note for them both?"
  },
  {
    "id": "reddit-18",
    "text": "I genuinely don't know if I'm being unreasonable or getting played.\n\nMy manager left in March. I was told \"we're restructuring, can you handle the team temporarily?\" I said yes because I thought it would be 4-6 weeks and would look good for a promotion.\n\nIt's now November. I'm doing the full job. 1-on-1s, performance reviews, hiring decisions, budget planning, the works. My title is still \"Senior\" and my pay hasn't changed.\n\nWhat I've been told:\n\n* \"We're waiting for headcount approval\" (3 months ago)\n* \"The promotion is in process\" (2 months ago)\n* \"Just need to finalize the new org structure\" (last month)\n* \"You're doing great, we really appreciate your flexibility\" (every week)\n\nI'm getting manager responsibilities with IC pay. My team thinks I'm their manager. Other departments treat me like a manager. I'm in manager meetings. But when it comes to title and compensation? \"Still in process.\"\n\nI keep being nice about it. Every time my boss says \"thanks for being patient,\" I smile and say \"no problem, happy to help.\" But internally I'm screaming because I've been patient for 8 months and I'm literally doing a job I'm not being paid for.\n\nAt what point do I stop being the \"team player\" and start being the person who says \"pay me for the job I'm doing or give it to someone else\"?\n\nBecause right now I feel like I'm teaching them that they can get manager-level work for senior IC money, and once you teach someone that, why would they ever change it?\n\nHas anyone been in this position? How did you handle it without torching your reputation? Or did you just eat it and move on?\n\nI'm genuinely torn between \"this is how you get ahead, prove yourself first\" and \"this is how you get exploited, demand what you're worth.\"\n\nWhat would you do?"
  },
  {
    "id": "reddit-19",
    "text": "I just put my PTO for December, and our HR person responded with: \n\n\"Congratulations for using all of your PTO! By using all of your time, it demonstrates that you value yourself, your family and friends, and the importance of time away from work to recharge and refocus. Taking your full-time off helps sustain productivity, creativity, and overall wellness, precisely the qualities we should carry over into the new year.\"\n\nWe only have 10 PTO days and they don't roll over to the next year. This is strange to congratulate!"
  },
  {
    "id": "reddit-20",
    "text": "Thanks in advance to this sub for letting me rant. I am open to any recommendations. 6 months ago I changed careers, it's been a rather steep learning curve, but about 2 weeks ago things began to click. My partner and I are the only people in our department. He is very experienced and while he is my peer, he has been instrumental in teaching me everything about the job. This was by design, and overall it's worked out very well. As I said, about 2 weeks ago I started getting the hang of things. We prepared for him to go on vacation and I wasn't worried. I had a good handle on things that needed to be taken care of while he was away and I have other resources available. Cut to the chase, we got some emails yesterday that needed thoughtful and detailed responses. I drafted them before the end of the day and my plan was to send them first thing this am after a read through to be sure I'm on point. I fire up my email to find that he responded to these message and also sent me messages about other things that I already was aware of. I am angry because this was a huge opportunity for me to show the skills that I've learned. Not only that, it seems to reinforce that I don't know what I'm doing because his out of office message indicates that he had no access to email and would not be responding to messages. End rant. Recommendations ( other than ripping him a new one via email). Thank you in advance fellow workers."
  },
  {
    "id": "reddit-21",
    "text": "Something I've noticed is that recruiters will email you, ask you for your availability in which I respond the same then they ghost me. I don't get it, why would you reach to me in the first place. This happened to me and a few of my friends looking for work.\n\nAnyone else experiencing something similar or is it just me?"
  },
  {
    "id": "reddit-22",
    "text": "So, my boss asked me to be in charge of overseeing the phone refresh project. The goal is to upgrade users with Iphone 12's to newer models. There are multiple tickets assigned to my team members, but none to me.\n\nSince I lack the authority to assign tasks, I decided to offer to handle tech problem tickets in exchange for team members focusing on scheduling the phone swaps. I also took the initiative to message users directly via Teams, scheduling follow-up messages to remind them to reach out to techs for their tickets.\n\nMy next step is to follow up with both users and techs to ensure the scheduling is done. Additionally, I plan to send a weekly progress email to my boss, with whom I have limited communication.\n\nTo increase the chances of success, I could consider adding regular check-ins with team members to track progress and address any issues promptly."
  },
  {
    "id": "reddit-23",
    "text": "I really dislike this time of year when we're asked to make goals for the next year. I just want to keep doing what I'm doing. I'm not looking to move up...I just want to do my job. After a while, there is only so much a person can list as a goal...or 3 to 5 goals. And I work remote so I can't have any goals that require in-person activities.\n\nEvery year, I have no idea what to even put, and it doesn't help that I wait until the last possible moment to get this done! 😭"
  },
  {
    "id": "reddit-24",
    "text": "Going back to work in person soon! I know it can get difficult to balance because it feels like the entire day is gone and you feel tired and don’t want to do anything after work during the week. I’d like to include gym after work. Also, anyone recommend a service for midday dog walking?"
  },
  {
    "id": "reddit-25",
    "text": "I'm looking for recommendations for an executive coach/speaker to give a maybe 2-4 hour workshop on avoiding micromanaging for a group of managers and staff. Stuff like being aware of what it looks like, how it affects morale, and tips to avoid it. Maybe some stuff on 'managing up' for staff looking for ways to address it either directly or through personal processes. \n\nSomeone who is able to be in person in Southern Ontario Canada, though potentially online could work.\n\nI know I can google it but I find recommendations to be more indicative of value particularly in the world of coaching."
  },
  {
    "id": "reddit-26",
    "text": "So I’ve been working full-time for almost 3 months now. I used to be an intern in one team, then got promoted — but to a totally different team. At first I was really excited, but honestly… I don’t think I like what I’m doing. It’s not even that I don’t want to care — I’m trying. I show up, I take notes, I ask questions. But I still have no idea what’s going on half the time. People talk about projects and numbers like everyone’s on the same page, and I just sit there thinking “what the heck are we even talking about.” I’m more of a creative person, while this work is purely analytical. I feel like I’m not dumb, but this job makes me feel dumb. The topics don’t click, and I just don’t find them interesting. Which makes it even harder to focus or learn. Now one of the executives is going on parental leave soon and I’m supposed to take over some of his stuff… which freaks me out because I barely understand my own tasks. Part of me wants to push through and do well — like, I want people to say “she really stepped up while he was gone.” But another part of me is just… done. Has anyone been in a job like this? How do you stay motivated when you honestly don’t care about the work? I don’t want to quit (at least not yet), I just need to survive this stage without losing my mind."
  },
  {
    "id": "reddit-27",
    "text": "My boss occasionally forgets to file our payroll on time, causing a one-day delay. Today, I didn't receive my pay and when I asked, she mentioned it was due to a federal holiday (Veterans Day) yesterday. However, today is not a holiday, and she usually files payroll on Mondays. I researched and found that if payday falls on a holiday, there might be a delay, but it shouldn't apply today. I'm unsure if this delay is legal or normal due to the holiday."
  },
  {
    "id": "reddit-28",
    "text": "I am an office administrator for a small contractor that I have been working for over 7 years. Other than the owner and his wife, I have been the only technical employee for the last 2 years. We sub out all of the work. Well, our main sub is also a general contractor and the owner of the company I am working for is wanting to sell to him supposedly by the end of the year. However, my boss hasn't been here for quite a long time other than to pick up mail. He is selling his house and did also tell me that he is wanting to be done by the end of the year. The guy my boss is selling to told me he spoke to him and my boss said he was on his way to his boat, to go sailing to the Bahamas for 6 months!\n\nHe thought he had everything figured out I guess, but it is not that simple. Anyway, my job isn't to make sure he is taking care of stuff. My job is to be the office administrator. Things have been slower lately so lately I find myself just doing what NEEDS to be done. I've had a rough morning with my kindergartner not wanting to go to school and hanging on to me. It's been a rough morning. My mom found out yesterday she has cancer. On the bright side of that it is Stage zero and seems she may not need chemo and possibly not even radiation. It's hard to talk to her about anything. I would just rather speak about my situation to a bunch of strangers, it's like therapy.\n\nI have lots of flexibility, my son was suspended for 5 days and for 4 of them I had him here with me at the office. I feel like I take advantage, but in my defense I haven't gotten a raise in 2 1/2 years."
  },
  {
    "id": "reddit-29",
    "text": "1. Having to come up with a business and development goal every 6 months can be challenging. They require 3 of each and when you feel stumped on what to say, it can be frustrating.\n\n2. Getting rushed multiple times a day is annoying. There always seems to be a man (so far it ALWAYS is) treading behind you so fast and loud right over your shoulder. It can feel like they are being intentionally disruptive.\n\n3. Coworkers being obsessed with what you have for lunch can be tiresome. Lunch should be a time to decompress, not to be interrogated about your food choices.\n\n4. Never having a moment of peace in the bathroom can be frustrating. It seems like all the bathrooms in the building are always occupied when you need a moment of privacy."
  },
  {
    "id": "reddit-30",
    "text": "I (23f) have been working full time for little over a year now as a materials engineer. I do not really care for my job, I don't love it but I don't dislike it either. Benefits are good, very well paid for a junior I think, everyone is incredibly nice, very understanding boss. Nonetheless, I leave my house at 7 am and get back somewhere between 17:30-18:00. By the time I get home, I have about 4-5 hours to myself, one of which I always reserve for an active-participation hobby like playing piano, sports, or language learning. During the autumn/winter months, I feel like I barely see the sun, and my friends' schedules never line up. I get up, go to work, come back, get ready for the next day, sleep, repeat. How do people go decades dedicating 90% of their awake time to their job, whether they like it or not, and not lose all motivation in life?"
  },
  {
    "id": "reddit-31",
    "text": "I was recently promoted to a supervisor in October and have been with the company for about 2 years. Today, I was asked for a meeting with HR, but my direct boss was not included, which is unusual. I had a recent issue with my direct deposit due to my promotion, but it was resolved. Now, I am invited to a meeting with HR and another colleague to discuss a concern that was brought to their attention. I am unsure about the purpose of the meeting, but I am staying positive and open-minded."
  },
  {
    "id": "reddit-32",
    "text": "I'm trying to use AI to create a completely passive income of around $3000-$10000 a month."
  },
  {
    "id": "reddit-33",
    "text": "The owner of the company where I work is suddenly changing people from the positions they've had for years, moving them to different offices, sometimes moving them to completely different fields, demoting them, and only keeping the ones who work diligently. Basically he's firing anyone who has been acting their wage, which is the minimum wage, and bringing around 60 workers from Asia. That's not counting that everyone here is salaried and don't get the legal benefits they should stated by the law. I'm already applying to other jobs and taking it easy, because after being demoted from the job that actually interested me and having the owner tell me on my face that the workers are not good enough, I'm internally laughing and applying."
  },
  {
    "id": "reddit-34",
    "text": "Multitasking sounds efficient, but I’ve come to think it’s one of the biggest hidden drains on creativity. Every switch between tasks costs focus, and the residue from one decision often clouds the next. It’s like carrying mental baggage between meetings.\n\nLately, I’ve been exploring ways to simplify work routines by segmenting focus time more intentionally. I noticed that reflective tools encourage structured thinking rather than endless task juggling. It’s not just about tracking work but improving the quality of thought behind it.\n\nHow do you deal with the pressure to stay “productive” while keeping your head clear? Is multitasking something you actively avoid or try to master?"
  },
  {
    "id": "reddit-35",
    "text": "genuine question. Do not think its burn out. I'm ready to work but the work isn't exciting."
  },
  {
    "id": "reddit-36",
    "text": "Didn’t expect to feel this sentimental today but man… I’m lucky to do what I do. I get to help veterans and their families every day, people who’ve already given more than most of us ever will. Hearing their stories is so humbling. I used to think work was just about numbers and paychecks and was so focused on that, but it’s not. It’s about purpose and serving vets and their families. So yeah… shoutout to all the vets out there today. You’ve done so much for all of us, and I’m just grateful I get to help in some small way."
  },
  {
    "id": "reddit-38",
    "text": "How can I cope with this? Huge line out the door, then my job requires so much bureaucracy and paperwork for certain transactions...and I'm new, so mostly some of it I still don't get! I feel overwhelmed right now but I need this job, I'm on my last savings!"
  },
  {
    "id": "reddit-39",
    "text": "Because apparently, we needed 12 people and 45 minutes to read one bullet point."
  },
  {
    "id": "reddit-40",
    "text": "I work a niche position in a large insurance company HQ. My job is mostly physical/hands-on so I’m here during normal business hours. The busyness ebbs and flows as I’m largely on-call. \n\nBut there's often hours of downtime daily between tasks. I like to stay busy. Have asked for (and received, and completed) additional tasks from other departments. There’s just nothing right now, but I can’t leave or work remotely. \n\nI really like my company and coworkers, I’m regarded highly and I’m great at my job. My superiors think I walk on water and largely leave me alone. Honestly I’m very lucky I have little to complain about! But I genuinely feel bad for doomscrolling on the clock.\n\nAnyone else with similar on-call type jobs feel this? What do you do with your time?"
  },
  {
    "id": "reddit-41",
    "text": "Does anyone work in an environment where people judge you for taking a one day off instead of a 2-week holiday? \n\nIt’s so weird. I work most of the year and I don’t take multiple weeks off so that I’m here to answer everyone but people seem to get annoyed. \n\nAnyone experience that at all?"
  },
  {
    "id": "reddit-42",
    "text": "Lately, I’ve been struggling to keep up with work. I used to average around 30 hours a week, and back then I thought I was underworking. Now, I can barely push myself past 15. I’m a game developer and a freelancer, and my motivation has just faded, and I also work remotely.\n\nBut this feels deeper like I’ve lost the drive that used to fuel me. Maybe it’s just exhaustion, or maybe it’s the isolation of freelancing. No team, no feedback loop, no real sense of progress or purpose. I remember being excited to try new things, build stuff, work on my ideas, but I just don't want to do anything anymore these days.\n\nJust needed advice, is there anything you did that made work meaningful again?"
  },
  {
    "id": "reddit-43",
    "text": "I wanna preface this by saying that from the culture where I am come from respect for your superiors and elders it's very engrained, and it's hard for me to part from that. I am also an extremely empathetic person, and guilty of absorbing people's feelings at times.\n\nMy supervisor wasn't necessarily a good person or a supervisor, but they weren't a monster. They had many faults but this situation feels like it's designed to humiliate them. They are now technically my peer, but in the few days they have been demoted, they have been chewed up for asking for help with the workload. We have been asked to delete them from email chains. It's like their existence makes management upset.\n\nI don't like to see them like this, it feels like if they had that many failures it would have been more humane to let them go. I don't know how to approach them for tasks because I cannot talk to them like I talk to the other people on my area. It's uncomfortable. It's sad.\n\nI guess basically, I need advice on how to overcome this situation. Should I offer support? Should I avoid interactions so I don't feel uncomfortable? Should I pray they decide to leave?"
  },
  {
    "id": "reddit-44",
    "text": "They all go the same- not just for me but for others I’ve known as well. They all start off great, you feel comfortable and satisfied with the environment and it all feels too good to be true. Usually because it is. Give it a month or two and it always ends up being drama, unnecessary pressure, and the weird feeling of a hierarchy over your head you have no control over. Especially if it’s a new store.\n\nI could go on and on about this as I’ve worked 3 in between my retail jobs and they all go like this. What are your experiences with working family-owned businesses and do you agree?\n\nI’m in the middle of another one of these situations and I feel like I'm losing my mind all over again. I’m looking for an out ASAP because the drama has just started- which is a shame because once again it is the management and not the job that makes me want to leave. I love my coworkers and even the lead of the new location I’m at who is related to the owners, it’s really just the owners themselves that make it miserable."
  },
  {
    "id": "reddit-45",
    "text": "Hi everyone,\n\nI am in a dilemma. I have been working at my current job for about 2 years. The job involves visiting customers in a mobile office setting, which requires me to drive at least 60 minutes one way. I am provided with a company car and gas, including some for personal use. On office days, I still have to drive 60 minutes one way, with remote work available one day every other week. Lately, this commute has started to bother me. Despite having a good salary and other benefits, my old company reached out to me a week ago, offering a slightly higher salary and the same benefits, but with the office located 15-20 minutes away.\n\nI am considering going back to my old company. What do you think?"
  },
  {
    "id": "reddit-46",
    "text": "Over the years of being FF/EMT-B I've seen and heard of some ridiculous complaints and attempted write-ups.\n\nThe dumbest complaint I ever received was from a rich girl who was the definition of Daddy's Money. She complained to my boss at the ambulance. We were transporting her grandmother to a doctor's appointment, and she mentioned she's going to Hawaii the next week. I mentioned to her that I've been to Hawaii and it's nice. She actually complained to the boss because I've been to Hawaii. From what I was told, she was trying to say it's for people like her and not me, a lowly blue-collar worker. My boss told her we're not transporting her grandmother anymore. He was fed up with her and her complaints.\n\nThe dumbest write-up someone tried to give me was from a lieutenant who was rude to begin with. It's a tie between two that he tried to give.\n\nThe first one was when my girlfriend came by the station, and I gave her some money to pay a bill for me. I gave her a kiss goodbye. The next day, I got called into the office, and he was demanding I get written up or fired for soliciting prostitution.\n\nThe second incident was when he wanted me fired because \"all veterans have PTSD\" and according to him, he was scared for his life.\n\nBoth attempts were rejected, and I went about my day."
  },
  {
    "id": "reddit-47",
    "text": "Strolling away from workstations could prove costly for some employees at a technology services company, as the company explores tracking productivity through mouse and keyboard movement.\n\nAbout a month ago, the firm rolled out a course for executives to familiarize them with workforce-management tools such as ProHance, as part of select projects, becoming arguably the latest to double down on micro-tracking employee activities.\n\nAn employee will be marked “idle if no keyboard or mouse activity is detected for more than 300 seconds,\" according to the course."
  },
  {
    "id": "reddit-48",
    "text": "Just received an email from the senior manager requesting a discussion about my role, with HR and my manager present. It seems like a typical redundancy setup, but there's a concerning pattern emerging. Over the past month, they have been meticulously documenting minor issues, leading to a shift in my performance evaluations from \"meeting expectations\" to \"concerns about output.\" Despite no actual changes in my work quality, the framing has shifted.\n\nI am apprehensive that they might be constructing a performance case to justify a lower severance package or coerce me into resigning instead of following proper redundancy procedures. If they label it as a performance issue, it could put me at a disadvantage.\n\nI am seeking advice on what questions to pose during the meeting, what language to be cautious of, and how to ensure they do not manipulate the situation to focus on performance rather than redundancy.\n\nI simply want to navigate this situation without being taken advantage of."
  },
  {
    "id": "reddit-49",
    "text": "I just started a new job with a temp agency. When they called to offer me the job, I didn’t want it because it’s customer service and I’m trying to move away from customer service. I wasn’t expecting to get the job at all (bad interview) so it caught me off guard and I agreed to take it. Now I’m on day 2 and I’m unhappy. I don’t want to keep working here.\n\nMy partner makes enough money to support us both on his salary, so he said I’d be fine to go without a job until I can find something more aligned with what I want to do, but I like making my own money.\n\nCan I ask the temp agency to find me another assignment while I still work this one? Or would they pull me from this assignment and not give me another one? I’m not sure what the right decision is.\n\nThanks!"
  },
  {
    "id": "reddit-50",
    "text": "Would you rather work 4 10hr days 7a-5:30pm or 5 8hr days 7a-3:30pm"
  },
  {
    "id": "reddit-51",
    "text": "My manager replaced me as project lead to “save” someone affected by a new company policy. Recently, my company implemented a time-in-grade policy. My manager has a few team members who will be impacted by this new change. I’ve been leading Project A, which is nearing completion. Out of nowhere, my manager told me that someone else will be taking over as the new person-in-charge once the project is delivered. The thing is — I’ve been the one managing this project from the start. When I asked why, my manager said the other person is “more knowledgeable” about the project. But that’s hard to accept because I’ve actually been the one sharing all the project knowledge with him. It’s pretty clear that my manager is trying to “save” this person because of the new policy. I’ve raised my concerns multiple times, but my manager keeps saying I’ll still have “good visibility” even if I’m not leading the project. I just don’t understand the reasoning behind replacing me, and it feels unfair. How do I deal with this kind of workplace bias?"
  },
  {
    "id": "reddit-52",
    "text": "I don't know if anyone else feels like this, but my job has been so boring lately. It's the same thing every day - just sitting at my desk and staring at the computer. I try to listen to music or drink more coffee, but time still feels like it's moving super slow. My coworkers are nice though; we joke around sometimes, so that helps. But man, I really need a break or something."
  },
  {
    "id": "reddit-53",
    "text": "Hi everyone,\n\nI am in a dilemma. I have been working at my current job for about 2 years. The job involves visiting customers in a mobile office position, which requires a 60-minute commute each way. I am provided with a company car and gas, including some for personal use. On office days, I still have to drive 60 minutes each way, with remote work available one day every other week. Lately, this commute has been bothering me. Although I have a good salary and other benefits in this job, my old company reached out to me a week ago, offering a slightly higher salary and the same benefits, but with the office only 15-20 minutes away.\n\nDo you think it would be a mistake to go back?"
  },
  {
    "id": "reddit-54",
    "text": "In Denmark a company can fire an employee for being sick more than 120 days of a year. Before the 120 days, they cannot (but could find other relevant reasons). I am curious to hear how it is in other countries, so please tell me."
  },
  {
    "id": "reddit-55",
    "text": "I applied for another position in the company and was offered the job. The job listing had a pay range starting at $10/hr, and I was offered the lowest amount within that range. I'm considering asking for a dollar or two more, which would still be on the low end of the listing. However, I'm unsure if I can negotiate since it's an internal move."
  },
  {
    "id": "reddit-56",
    "text": "If you have a good working relationship with your boss but have a temporary job position - would you ask your boss to recommend you to her boss for an internal job you applied for?\n\nFor reference, the job applied for would make me her colleague."
  },
  {
    "id": "reddit-57",
    "text": "Earn Credits & Learn - Digital Marketing Internship"
  },
  {
    "id": "reddit-58",
    "text": "I wonder which apps you use to manage your schedule, both for personal and business?"
  },
  {
    "id": "reddit-59",
    "text": "The fashion industry, especially retail, is facing challenges with young employees feeling restricted. Despite working at various companies in hopes of a positive change, I consistently found myself in workplaces where younger generations lacked freedom of speech and decision-making authority. \n\nMany US companies follow a pattern with older white men in top leadership roles, often displaying conservative behavior and sometimes verbally harassing female staff. There are middle-aged Asian women handling menial tasks, underpaid Asian women in the sewing department, and predominantly white staff in other departments. The older generation, born before 1980, tends to prioritize company loyalty over work/life balance, with minimal benefits and pressure for high efficiency.\n\nIt's concerning that the fashion industry generates revenue mainly from women, yet a large majority of companies are male-owned, with a significant female workforce. This imbalance suggests a trend of male owners profiting from female consumers and employees, perpetuating unequal treatment. Supporting women-owned sustainable brands may be a way to contribute positively. The industry's exploitative nature remains a significant issue."
  },
  {
    "id": "reddit-60",
    "text": "I just graduated with a degree in Computer Science. During my studies, I borrowed money from financial services for personal expenses, assuming I would easily repay them once I secured a job. I have been offered a job but am still waiting for the official confirmation. In the meantime, I have accumulated more debt trying to pay off the initial loans, which has now reached over 1 lakh. I am feeling extremely anxious for the past two months and haven't been able to confide in my parents about this situation. I am struggling with negative thoughts every night and feeling lost. I am seeking online work opportunities, particularly in Java and SQL, as a last resort. I have a looming deadline to pay a significant amount of interest next month, and the thought of my parents finding out or creditors coming to our home is overwhelming me."
  },
  {
    "id": "reddit-61",
    "text": "I work in a professional healthcare environment where we see many patients daily. My coworker is kind of snarky/sassy - she's pretty funny but borders on mean-funny. \n\nShe asks practically every single patient what their Sign is. And I get that she's trying to make conversation and make a connection - but it borders on silliness. If I went to my doctor's office and the nurses were asking me what my Sign is - I would think, ummmm maybe you should focus on my blood pressure? \n\nHonestly I just find her overall to be shallow and silly - and the horoscope stuff is a daily annoyance to me. \n\nWould you say something to her? Should I just grin and bear it?"
  },
  {
    "id": "reddit-62",
    "text": "My office has a new director. He’s very nice but he kinda acts like he’s our elementary school principal. He seems to think that the way to build office spirit is to lecture us about having good attitudes in a childlike way and is bringing us gratitude crafts for Thanksgiving. Is this fixable? Why is he doing this?"
  },
  {
    "id": "reddit-63",
    "text": "Hello! I recently got my first job, after searching for 3 months and applying to 30+ jobs. It’s a pretty chill job and I like working there! My problem is the pay is only 8/hr. I didn’t mind that whenever I applied, because I told the interviewer I was available pretty often. I could work about 25-30 hours a week if I needed to, and I want to. But I’m only scheduled 9 hours this week, and according to the other employees that’s pretty common. My mom told me I should pick up another job but it was hard enough getting this one, and if I got another job I’d probably get fired because according to the manager that would mean I wouldn’t have “open availability.” I don’t really know what to do because it seems pointless to me to work 1-2 days out of the week and only get around $80, but I don’t wanna quit because I literally just started and I don’t want it to look bad to my future employers."
  },
  {
    "id": "reddit-64",
    "text": "Are there any that anyone here can recommend? I been through two now. Both of these broke on me in a short time, but I guess that's expected. Thankfully, I really haven't been spending money on each since I been getting warranties and both have been fully reimbursed.\n\nI would love to know if there's actually a 'good' one that I can rely on out there. Anyone use one that can let me know if they recommend it?"
  },
  {
    "id": "reddit-66",
    "text": "Basically I work in construction and my work has three shifts available. Days, evenings and nights. I've worked at this location for 8 years and have been primarily days which is 7am-330pm. Sometimes you get moved between shifts to accommodate manpower but are only mandatory to do 30 days before you can switch back to your preferred shift. I did an 8 month stint on evenings which was 4pm-midnight and I honestly loved it but was forced back to days. \n\nCurrently Im toying with the idea of switching to nights or 'backshift' which is roughly Midnight-730am. You get a 30% bonus on your pay which is huge and obviously your commute to and from work is much less traffic. I'd do evenings again but than I'd basically never see my GF given she works the standard mon-fri day shift. \n\nJust looking for tips on how to be successful working this type of shift. Looking for things like...\n\n- What time would you sleep until to ensure you werent tired throughout the night?\n\n- Best ways to ensure I can get good rest at home during the day? \n\n- Dieting. Do you even bring food? Do you drink coffee etc?"
  },
  {
    "id": "reddit-67",
    "text": "While working for a Fortune 500 company, it was discovered that one individual had been on the job for over 3 years and technically he had no job title. He fell through the cracks. When, after a few days at work he realized that no one was looking for him to run a machine or deliver product from the warehouse to the production floor, he got himself a clipboard and a yellow legal pad and each night he would talk to all of the people in the production floor, asking them various questions, and writing down their answers. Then a new 3rd shift supervisor was assigned when the former one retired, and he made it a point to interview each person that worked under his supervision. When he got to “Clipboard man” it was quickly realized that this guy had been gold bricking for over 3 years. He was reassigned to a new job and left a few weeks after being reassigned."
  },
  {
    "id": "reddit-68",
    "text": "With inclement weather, I informed my boss and he approved me working from home. I updated my team's status to Working Remotely, but some coworkers keep asking if I'm coming in. Should I mention it in the group chat or add it to the calendar? I prefer to avoid unnecessary attention."
  },
  {
    "id": "reddit-70",
    "text": "Do you use Miro or Lucid for team coordination? What makes you prefer one over the other?"
  },
  {
    "id": "reddit-71",
    "text": "I work in a large supermarket in the UK. I work with a colleague and we get along well, even though we are in different sections. I often chat with her after work, which makes me late for dinner. She recently referred to me as her friend, which was unexpected.\n\nHow long should you be 'work friends' before trying to become 'out of work' friends? In my retail job, there are no promotions and no competitive atmosphere."
  },
  {
    "id": "reddit-72",
    "text": "I'm working on a startup where the discipline feels chaotic, and I'm tasked with responsibilities I dislike, such as being onsite with an endless workload and constantly changing requirements. Should I leave this company? My boss said it would improve, but the unending, unfinished commitments and this environment are already making me feel burnt out. Currently, I only get 3 days off, and during that time, I feel both mentally and physically exhausted. I'm afraid I can't continue like this anymore."
  },
  {
    "id": "reddit-73",
    "text": "A couple weeks ago, my boss liked his colleague’s LinkedIn post about hiring for a new team that aligns with my interests. Recently, they had a call, possibly discussing support for project-based work. I noticed a new job posting for that team and believe I'd be a good fit. However, my boss is unaware of my interest as I haven't mentioned it.\n\nI'm currently on PTO, making it inconvenient to discuss before applying. I'm unsure whether to wait and talk to him later or apply quietly now. This opportunity is time-sensitive and significant for my career growth.\n\nI'm new to the professional world, working hard at my first job post-grad. While I've gained valuable skills and received positive feedback, I'm eager to explore new opportunities and continue growing. I believe my boss values my progress and would support my advancement."
  },
  {
    "id": "reddit-74",
    "text": "Hi all,\n\nI hope you are all doing well.\n\nI am due to start my new role today working for a tech company. If I pass probation, I will be in a position to buy a house for me and my family.\n\nWe are currently homeless.\n\nThe desperation to succeed has never been so overwhelming for me. Does anyone have any advice on how to pass the first 6 months probation period?\n\nThank you."
  },
  {
    "id": "reddit-75",
    "text": "The woman who trained me was not very involved and spent more time gossiping and being on her phone. Her training was minimal, with me doing most of the work. I recently completed a certification test for filling and exchanging propane tanks. When I informed a customer that their 10-gallon tank was expired and couldn't be filled, they opted for a 5-gallon exchange instead. However, I faced issues with where to store the tank as it didn't fit in the designated area. My boss reacted strongly, blaming me for a potential loss of $20 as the company wouldn't accept the tank. I explained that I was never informed about this situation during training or in the test. Despite my boss's reaction, I believe that proper training should have covered such scenarios to avoid confusion and mistakes."
  },
  {
    "id": "reddit-77",
    "text": "I’m considering a 6-month internship starting January. I just finished a 6-month internship after graduation and have been unemployed for 4 months. This new internship is a contract with a long time commitment. Although there’s potential for conversion to full-time, it’s not guaranteed, and I’m unsure if I’d fit in. The salary is low, and as a fresh graduate, I feel time is running out.\n\nThe other potential job locations are far and tbh I don’t know if they say this to multiple candidates just to get them to wait.\n\nThat option is 80–90 minutes each way — with long office hours. Including commuting, dinner, and personal time, my actual day would be roughly 6:45 am to 9 pm. I’ve seen a lot of job listings that are far away and I’m wondering if it’s even worth applying for in the first place.\n\nIdeally, I want full-time work with a better salary and hybrid hours, but Singapore’s design industry seems limited in suitable roles.\n\nMy ideal career path is in media, photography, directing, film, entertainment, content creation, art, games, illustrator, animation, events, set designer, concept artists, or exhibitions. However, I currently lack the expert skills or connections and would need to self-study or take short courses. I have a lot to learn still for art fundamentals. These roles often require building your own path rather than a linear career trajectory.\n\nQuestions/concerns:\n1. Can I change or leave an internship or job if a better offer comes after signing the contract, without burning bridges or causing legal issues?\n2. Should I wait for a better role or take whatever opportunity is available first?\n3. How does Singapore compare to markets like Dubai or Australia for creative/design roles?"
  },
  {
    "id": "reddit-78",
    "text": "I feel stuck, unseen, and honestly… tired of trying to make people understand what I do."
  },
  {
    "id": "reddit-79",
    "text": "So that was helpful. We can be more courteous to one another now, but what a disappointment! \n\nShe talked in circles. She brought up zingers from the past, then said that those things don’t bother her when I said she should have talked to me about those issues then.\n\nShe repeatedly refused my request to have a team meeting with others on my level who are struggling. I kept saying that it wasn’t about her, just that it would be helpful to express our needs to create a more positive culture. She remained defensive on that issue throughout. \n\nMy main point was please communicate with me on things that affect me. Got no promises. She just said we’re adults and need to get along."
  },
  {
    "id": "reddit-80",
    "text": "Long story short, I work in a manufacturing plant. In the area I work, we have a machine that loads glass, washes it, and sends it down the line. We can't have broken glass inside the washer, so the broken glass detector is turned on by default. \n\nMy boss turned it \"off\" and forgot to re-enable it. Glass got inside the washer and made a big, expensive mess. Our operations manager got really upset and my boss blamed it on me. To turn off the detector, you need to log in and we keep logs of it. I was able to get proof he did it and screenshotted it in our Teams channel. Someone told me it was really rude to put that in the public channel. I should have messaged the ops manager directly. Was I wrong?"
  },
  {
    "id": "reddit-81",
    "text": "I work in a big advertising agency and have been there for 8 years. Four years ago, I received a promotion to be Team Lead due to the previous Team Lead being on extended sick leave. However, after 1 1/2 years, she unexpectedly returned. Despite sharing my knowledge and welcoming her back, I found myself excluded from meetings, moved down in the team chart, and given a desk in a corridor. I felt lost and unsure of what to do. Despite raising the issue during my annual feedback interview and reaching out to HR multiple times, I received no resolution. I later learned that this treatment is a form of mobbing called \"straining.\" I am considering legal action as I have evidence of their mistreatment. I have upcoming job interviews and hope to leave the company."
  },
  {
    "id": "reddit-82",
    "text": "I’m a new employee. My female coworker stares at me. She slowly looks me up and down, very slowly, head to toe, every time I see her. She’s married, knows I have a boyfriend, so it’s not like *that*, so what the hell is it? She very obviously catches me looking at myself after she does this. Is she messing with me, or trying to make me feel self conscious? I really don’t get it, it’s kinda strange how she does it and how often.\n\nI’ve asked her about it and she denies ever doing it. It’s impossible for me to ignore her because she has my same job, is my senior and trains me, it’s just weird and I’ve never experienced this before."
  },
  {
    "id": "reddit-84",
    "text": "Before working where I am I didn't really have too much of a social life and I didn't have a lot of experience in social aspects. Here at work my bosses and coworkers seem to get super frustrated with me and I don't know why. I am a full-timer at a grocery store chain in New England and part of my job is to order and stock up my aisle (cleaning products). My manager didn't like how I was ordering and ordered 5+ pallets for a single day. I told him I'm going to need help because I won't have the time to get it all done, which is completely reasonable to say. So then he starts helping me in my aisle stock everything and was having trouble finding where something goes. I tried to point him in the right direction and he straight up told me to leave him alone. Another example is from today, someone at the warehouse packed one of my pallets wrong and when I tried to bring it out to my aisle, the pallet tipped over and fell everywhere (not my fault they messed it up at the factory). One of my bosses proceeds to yell at me and is borderline calling me incompetent and that I can't handle my responsibilities. Basically, nobody helps me, nobody talks to me, I get no positive sentiment only negative sentiment and I'm tired of it. My boss borderline criticizes me, one time when I got really upset about something I actually cried and ended up calling my mom in frustration. When I tried to go to the store manager, he basically called me a baby and immature for calling my mom and berated me about it. I'm pretty sensitive so when something like this happens it honestly ruins most of my day. I come into work and do my job to my fullest capabilities, treat everyone nicely and with respect, and I still get criticized constantly. It's not fair and depressing."
  },
  {
    "id": "reddit-85",
    "text": "Dealing with jealousy from coworkers after early success"
  },
  {
    "id": "reddit-86",
    "text": "My manager asked me to remove my earrings on Friday because they dangle. I don't plan to remove them because it is my religious expression. And they are not a safety issue. In the handbook, I see nothing about piercings other than you're limited to 2 earrings, no lip or cheek piercings allowed. Nothing stating they cannot be hoops or dangle. I have a feeling they'll make me clock out when I return, and I haven't removed my piercings. Would this be a violation of my civil/religious rights?"
  },
  {
    "id": "reddit-87",
    "text": "I am going to have a position that plays a key role in the hiring process for my department soon, and I have a clear preference in hiring. I prefer to hire older people. I've found that people who have families, or real responsibilities tend to take their job more seriously while the young individuals don't last, because this job is extremely difficult, and the starting pay isn't great for the industry, meaning most young individuals still living with parents, or just not looking to build a career usually say \"forget this\" and leave.\n\nOne of the young individuals who showed promise that I trained has done great, and is now foreman of his own crew, so I'm aware that this isn't always true, so age won't be a deal breaker or the deciding factor, but it will definitely be something I'd like to consider as a tie breaker. Is this alright or would I be discriminating or just being unfair?"
  },
  {
    "id": "reddit-88",
    "text": "From the organizational chart, I belong to the Science and Technology department. But then, I am also under health and nutrition or Gut health and Nutrition, and it seems like it's whatever the leadership wants to call it depending on what phase of the moon it is. It doesn't affect my job, though. Who else has this odd confusion?"
  },
  {
    "id": "reddit-89",
    "text": "Long story short we're both assistant managers in our company, there are 4 of us in total, he's the only male. I get on really well with the other 2 female managers but he is quite friendly with our male boss. Male manager constantly criticises me, doesn't take my authority seriously, and is quick to call me out publicly for small mistakes we all make. So over the past few weeks I've been baiting him by being super sweet and kind to get proof of him targeting me. I sent him a message bringing up an issue with one of his employees and he went off on an aggressive rant. Now I have written proof of his attitude towards me. I don't know what my next step should be - do I confront him in person or continue to be polite? I told my boss and she said I should address issues with him in person. Any advice is welcome as I'm new to workplace environments."
  },
  {
    "id": "reddit-90",
    "text": "I’m going to start off by saying I realize I’m at fault here. This week alone we had someone quit so we only have 4 employees. Yesterday (Friday) around 9pm I started having some symptoms (my dad and uncle are currently sick the past 3 days) I woke up felt crappy but went anyway as I took some medicine. But it only got worse and I couldn’t do anything without wiping my nose or sneezing (I work with food so not good) I texted my manager and she called my coworker who agreed to come in but is so angry with me she won’t even speak to me. I agree, I should have just called in this morning but I thought I could do it. (I’m obviously a people pleaser so this bothers me a lot)"
  },
  {
    "id": "reddit-91",
    "text": "I understand that top IT professionals who have the most skills and experience in the field are pretty safe, but every day I learn about so many people being laid off not just from the news, but from my personal and professional connections as well.\n\nIt is around 2019-2021 I kept hearing about IT being a \"top career to choose because computers are the future, you should go in tech\", and many of my friends and colleagues enrolling in various IT programs, bootcamps, etc. and, actually, some of them getting pretty decent jobs in the end. But now it is super uncertain.. even scary.\n\nMany people getting laid off left and right in many fields these days, but IT seems to be the most layoff-prone at the moment.\n\nWhy is it so? Can't be just the AI, right?"
  },
  {
    "id": "reddit-92",
    "text": "Hey, I'm looking at work TV. I know some subscriptions don't show certain games. I got Paramount and I couldn't watch any of the fight streams. I'm located in Michigan (Detroit area). Basically, I really don't wanna pay for cable just for the boxing live."
  },
  {
    "id": "reddit-93",
    "text": "Got drunk at an office event two days back. For some context, I was part of organizing a week-long event in two cities - did the labor and coordination. I was sleepless, hungry and had just some wine in my empty stomach.\n\nAfter the wine, my coworker asked about my dating life - so the coworkers were on one end and the external guests on the other, but maybe I was a bit too loud, I have no idea. He talked about his dating life, another colleague joined and my manager also joined it. It was a jovial conversation. I think so.\n\nThen I had conversations with my manager, by then fully drunk. I asked her about why she selected me for the work, what my strengths are, how I should improve and with respect to her former employees how was I doing things.\n\nNow the conversations were all good, until one of the other colleagues gave me a look and sort of told me to stop (shut up kinda) with a scowl on their face, in such a way that I had gone overboard and then the dinner ended. Now I'm so confused - I feel like I did something wrong, but I don't feel like I overstepped the boundaries or was too loud to disturb the crowd....\n\nWhat do you think? Should I be worried or is there something wrong that I'm not able to figure."
  },
  {
    "id": "reddit-94",
    "text": "I'm trying to figure out if I'm too friendly at work or if this is just my personality, and whether I need to change it to be more professional. For context, I don't think I'm unprofessional in the traditional sense. I don't talk about my personal life unless someone ask. I don't gossip or badmouth people. When others gossip, I just listen without giving any emotional response or taking sides. I only talked negatively about someone once, and it was someone who was genuinely giving everyone a hard time. But here's my concern: I joke around sometimes during meetings, and I'm always smiling. I feel like maybe I'm too friendly with people, and I'm wondering if that's hurting my professional image. I've been thinking about just stopping the joking completely to see what happens, but I'm not sure if that's the right move. Should I be more firm? How do you find the balance between being personable and being taken seriously? Is this actually a problem, or am I overthinking it?"
  },
  {
    "id": "reddit-95",
    "text": "I’ve been ignoring indicators that they’re interested in me for the past year. They’re a bit of a unique individual.\n\nBut last night at midnight I got a notification that they added me on LinkedIn. It feels really inappropriate to me. Do I say something?"
  },
  {
    "id": "reddit-96",
    "text": "There are individuals who have been at their jobs for 20 years. Are they simply stuck at their job due to financial obligations or lack of interest in pursuing new opportunities?"
  },
  {
    "id": "reddit-97",
    "text": "I’ve been put on a Performance Improvement Plan (PIP) it was a written warning but the form screams pip without a date, and honestly, it feels like management is trying to frame me as “underperforming” when, by almost every measurable metric, the numbers speak for themselves. Profits are up, employee retention is solid, work schedules are running smoothly—all the things that actually matter.\n\nThe PIP claims I spend too much money and don’t complete tasks on time. The “spending” was me buying necessary tools for my team—tools that previously employees would have to provide themselves. In a food facility, you can’t just have people bringing in their own stuff, so this was literally the responsible thing to do.\n\nFeedback has been vague and feels framed to make me look bad rather than constructive. On top of that, I’m growing wary of the plant manager, who seems more interested in asserting authority than supporting employees or acknowledging results. I try to be a good manager, and my team agrees, but higher-ups don’t seem to care about the actual outcomes.\n\nHas anyone else experienced a PIP that seems more like a “gotcha” than a real chance to improve? How do you navigate a situation where you’re being criticized despite your metrics clearly showing success?"
  },
  {
    "id": "reddit-98",
    "text": "Hello all, I work as a driver at a pizza delivery store. One of the assistant managers was being rude and yelling at everyone today. When I was called up for my delivery run, I had to choose from three orders on the board. I checked the receipts to make sure I grabbed the correct ones for delivery. The manager yelled at me to just grab my order and go, but I calmly explained that I needed to verify the correct orders. Despite the manager's reaction, I grabbed an order and left for the delivery. Later, I found out that the manager was venting about our interaction to other staff members. I was informed that the manager sometimes has bad days. My question is, is it appropriate for me to stand my ground when it comes to how I am spoken to at work?"
  },
  {
    "id": "reddit-99",
    "text": "I've been working in a lobby of a high-end residential building for over a month now. The job involves monitoring footage, receiving packages, and notifying about guests. The pay is minimal, and it seems like a last-resort job. The lobby team, mostly men above 30, works round the clock. Some of them make inappropriate advances towards me, which can be uncomfortable.\n\nRecently, a coworker from a different building in the same company made me feel uneasy by boasting about his wealth and making inappropriate comments and gestures towards me.\n\nThis job may be more suitable for men, especially those working at night who can watch movies or even have a second job. However, as a young woman working during the day, I often face unreasonable demands from wealthy residents. I have to cut costs by eating cheap ramen noodles while they order expensive food daily.\n\nIt's important to consider the dynamics of the job before choosing to work in a position where you may be the only young woman and have to serve people from higher social classes.\n\nI would appreciate any advice or similar stories to share."
  },
  {
    "id": "reddit-100",
    "text": "I've been fully remote since 2017. At my last job, my managers had virtually \"met\" my partner, knew he was also remote--working for a different department in the same company, in fact--and had spoken to him themselves enough to recognize his distinct accent. But the few times they heard my partner obviously giving a status update about something or answering a work question in the background of a call with me, they grilled me about what they were hearing and who it was. Every time, I reminded them about my partner who also worked from home and apologized for the fact that they could overhear his meeting. One of them started forcing me to be on video during all meetings, which of course revealed nothing other than our shared basement office and my partner at his desk behind me. Even the day after I put in my two week notice, they asked me to join one last team meeting where this happened *again*, this time in front of the whole team. Thanks for the reminder of my reasons for seeking and finding a new job, I guess. Has anyone else ever experienced anything like this? How do you prove you're *not* overemployed in this kind of situation? They could have asked me to consent to a background check, which would have revealed other jobs if I'd had them, but did nothing outside of this bizarre witch hunt."
  },
  {
    "id": "reddit-101",
    "text": "I want some advice. I work as a civil engineer (we dig trenches and install internet lines). I’ve worked here for four years with my dad, who’s 64, and another coworker I’ll call *George*.\n\nThe issue is George is completely useless. He can’t lift a slab—my dad has to do it for him. He can’t connect the hydraulic fittings on our equipment, hides behind the van, and is constantly on his phone.\n\nHe also caused an accident on the motorway and has been off for five weeks since, and honestly, things have only improved without him. I’ve told my supervisor multiple times, but nothing changes. They say he’s protected by “red tape.”\n\nWould I be out of line if I contacted my supervisor’s boss about it? I have plenty more examples, but I wanted to keep this short."
  },
  {
    "id": "reddit-102",
    "text": "Yesterday the boss informed me that I would be laid off the week of Christmas due to financial constraints and the government shutdown. Any advice on how to pass time with minimal work? I'm currently taking frequent restroom breaks to apply for jobs and browse Reddit."
  },
  {
    "id": "reddit-103",
    "text": "I was watching a founder on a podcast discussing how younger employees can sometimes outpace seniors due to their faster learning abilities. It's common to see older employees bring depth, while younger ones adapt quickly and learn fast. The real challenge lies in managing this mix without ego interfering. So, if you're leading a team, do you value experience or learning speed more?"
  },
  {
    "id": "reddit-104",
    "text": "It’s frustrating to see coworkers being picky about the Swedish food catered for the hockey team. It's surprising that some adults would openly criticize the food, especially considering the cultural significance and the fact that a third of the team is from Sweden. Swedish cuisine is generally nonoffensive and includes dishes like meatballs, creamy noodles, and fried chicken. It's disappointing to witness this negativity in the workplace, but there may not be much that can be done about it."
  },
  {
    "id": "reddit-105",
    "text": "Hey everyone. Lately I’ve been feeling exhausted at work even when the day isn’t that busy. I get things done, but it feels like I’m running on autopilot and not really there. I don’t know if this is just being tired or if it’s some kind of burnout creeping in.\n\nHow do you tell the difference between just needing rest and actually needing a bigger change?  \nHave any of you been through something similar and found something that helped?\n\nWould really appreciate any insight."
  }
]
